Repository: Tzintzun444/Django-pswrd_entropy_gen
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: This version or language is not available or does not exist
es: Esta versión o idioma no está disponible o no existe

source: Log Out
es: Cerrar sesión

source: Confirm Log Out
es: Confirmar cierre de sesión

source: Are you sure you want to log out?
es: ¿Estás seguro de que quieres cerrar sesión?

source: Cancel
es: Cancelar

source: See my passwords
es: Ver contraseñas

source: Home
es: Inicio

source: Generate a Password
es: Generar contraseña

source: Settings
es: Configuraciones

source: Log In
es: Iniciar sesión

source: Link to GitHub repository
es: Link al repositorio de GitHub

source: Latest version
es: Versión más reciente

source: Password Entropy Generator
es: Generador de contraseñas por entropía

source: What is this project?
es: ¿Qué es este proyecto?

source: This password generator was originally created as a way to apply Python knowledge, but it gradually evolved into a technical, simple, and flexible tool with a clear purpose: to produce passwords that are reliable, strong, and resistant to being cracked.
es: Este generador de contraseñas nació como una forma de aplicar conocimientos en Python, pero con el tiempo evolucionó hacia una herramienta técnica, sencilla y flexible con un propósito claro: generar contraseñas fiables, robustas y difíciles de descifrar.

source: It’s not meant to generate easily memorable passwords, but to offer high-security credentials—especially valuable in systems that demand maximum protection, such as sensitive credentials, environment variables, access keys for servers, or APIs.
es: No está diseñado para crear contraseñas fáciles de memorizar, sino para generar claves con altos niveles de seguridad, especialmente útiles en sistemas donde se requiere protección máxima, como credenciales sensibles, variables de entorno, claves de acceso a servidores o APIs.

source: Why trust entropy?
es: ¿Por qué confiar en la entropía?

source: The strength of a password isn't about how “complicated” it looks—it's about how unpredictable it really is. That unpredictability is measured using a core concept from information theory: <strong>entropy</strong>. In this project:
es: La seguridad de una contraseña no se basa en lo complicada que parezca, sino en cuán impredecible es. Esa impredecibilidad se mide mediante un concepto fundamental de la teoría de la información: <strong>la entropía.</strong> En este proyecto:

source: Each password includes a real entropy value in bits.
es: Se calcula la entropía en bits de cada contraseña.

source: It estimates how many attempts per second would make a hacker to crack it by brute force.
es: Se estima cuántos intentos por segundo haría un hacker para descifrarla mediante ataques de fuerza bruta.

source: It calculates a decryption time, offering a reliable reference for how hard it is to break.
es: Se calcula el tiempo de descifrado como referencia práctica y confiable.

source: This gives you a real, data-based understanding of your password’s resistance—far more meaningful than a generic strength meter.
es: Esto te permite saber con datos reales cuán resistente es tu contraseña, más allá de la intuición o de los típicos indicadores visuales.

source: Design philosophy
es: Filosofía de diseño

source: This tool doesn’t rely on commercial standards of password complexity. Instead, it offers:
es: Esta herramienta no busca cumplir un estándar comercial de complejidad visual, sino ofrecer:

source: Generation free of human bias.
es: Contraseñas generadas sin sesgos humanos

source: Full control over configuration and strength.
es: Control total sobre su configuración y nivel de seguridad

source: A mathematical foundation behind each password
es: Fundamento matemático y técnico detrás de cada generación

source: Adaptability to a wide range of environments (development, production, CI/CD, etc.)
es: Adaptabilidad para diversos entornos (dev, prod, CI/CD, etc.)

source: The generator is flexible by design, allowing each password to suit the security level required for its context.
es: La flexibilidad del generador permite ajustar cada contraseña a la necesidad específica del sistema en el que se utilizará.

source: Project purpose and philosophy
es: Propósito y filosofía del proyecto

source: This project was created with a practical and educational spirit—starting as a personal exercise in Python and growing into a tool meant for developers, sysadmins, and anyone seeking real security without unnecessary complexity.
es: Este proyecto fue creado con una visión práctica y educativa. Al principio como ejercicio personal en Python, y luego como una herramienta pensada para desarrolladores, sysadmins y usuarios que buscan seguridad sin complicaciones.

source: It is built to be Open Source, freely shareable and continuously improvable. Its purpose is to promote solid practices, protect sensitive systems, and offer a solution rooted in theory rather than guesswork.
es: Está diseñado para ser Open Source, compartido libremente y mejorado colaborativamente. Su propósito es promover buenas prácticas, facilitar la protección de sistemas sensibles, y ofrecer una solución basada en teoría sólida en lugar de estándares subjetivos.
