Repository: Tzintzun444/Django-pswrd_entropy_gen
Catalog: generator/locale/*/LC_MESSAGES/django.po
Languages: es

source: Length of the password
es: Longitud de la contraseña

source: These characters will appear in the password
es: Estos caracteres aparecerán en la contraseña

source: These characters won't appear in the password
es: Estos caracteres no aparecerán en la contraseña

source: Must be between 1 to 30
es: Deber ser entre 1 a 30

source: A character is crashing in custom and not allowed characters
es: Un caracter colisiona entre los caracteres personalizados y bloqueados

source: There are more custom characters than available characters in the length of the password.
es: Hay más caracteres personalizados que caracteres disponibles en la longitud de la contraseña

source: Generate Passwords
es: Generar Contraseñas

source: Generate a Password
es: Generar contraseña

source: Length
es: Longitud

source: Uppercase
es: Mayúsculas

source: Numbers
es: Números

source: Punctuation
es: Puntuaciones

source: Custom characters allowed
es: Caracteres personalizados

source: Characters not allowed
es: Caracteres bloqueados

source: See my passwords
es: Ver contraseñas

source: The generated password was
es: La contraseña generada fue

source: Save password
es: Guardar contraseña

source: Don't save
es: No guardar

source: Generated Passwords
es: Contraseñas Generadas

source: Password
es: Contraseña

source: Entropy
es: Entropía

source: Time to decrypt it
es: Tiempo para descifrar

source: Generation Date
es: Fecha de creación

source: Delete Password
es: Borrar Contraseña

source: years
es: años

source: Delete
es: Eliminar

source: Confirm deletion
es: Confirmar eliminación

source: Are you sure you want to delete the password?
es: ¿Estás seguro de que quieres eliminar la contraseña?

source: Cancel
es: Cancelar

source: You have not generated passwords yet
es: No has generado contraseñas aún

source: Previous page
es: Página previa

source: Page
es: Página

source: of
es: de

source: Next page
es: Siguiente página
